controllers/UserController.php

    public function actionLogin() {
        $modelLoginForm = new LoginForm();
        $post = \Yii::$app->request->post();

        if ($modelLoginForm->load($post, '') && $modelLoginForm->login() ) {
            $roleName = Role::findOne(\Yii::$app->user->identity->role_id);
---
SELECT * FROM `role` WHERE `role_id` = 2

    public function actionAdduser()
    {
        if (!$post = \Yii::$app->getRequest()->getBodyParams()) {
            throw new \yii\web\HttpException(400, 'Дані не отримані');
        }
        if (User::findByUsername($post['username'])) {
---
SELECT * FROM `user` WHERE `username` = 'registrar'